{
    "Average Volume": "5,391,921",
    "Description": "AbbVie Inc. discovers, develops, manufactures, and sells pharmaceuticals worldwide. The company offers Humira, a therapy administered as an injection for autoimmune, intestinal Behçet's diseases, and pyoderma gangrenosum; Skyrizi to treat moderate to severe plaque psoriasis, psoriatic disease, and Crohn's disease; Rinvoq, a JAK inhibitor to treat rheumatoid and psoriatic arthritis, ankylosing spondylitis, atopic dermatitis, axial spondyloarthropathy, and ulcerative colitis; Imbruvica for the treatment of adult patients with blood cancers; and Venclexta/Venclyxto to treat hematological malignancies. It also provides facial injectables, plastics and regenerative medicine, body contouring, and skincare products; Vraylar for depressive disorder; Duopa and Duodopa to treat advanced Parkinson's disease; and Ubrelvy for the acute treatment of migraine with or without aura in adults; Qulipta for episodic migraine. In addition, the company offers Lumigan/Ganfort and Alphagan/Combigan for the reduction of elevated intraocular pressure(IOP) in patients with open angle glaucoma (OAG) or ocular hypertension; Restasis, a calcineurin inhibitor immunosuppressant indicated to increase tear production; and eye care products. Further, it provides Mavyret/Maviret to treat chronic hepatitis C virus (HCV) genotype 1-6 infection and HCV genotype 1 infection; Creon, a pancreatic enzyme therapy; Lupron to treat advanced prostate cancer, endometriosis and central precocious puberty, and patients with anemia caused by uterine fibroids; Linzess/Constella to treat irritable bowel syndrome with constipation and chronic idiopathic constipation; and Synthroid for hypothyroidism. It has collaborations with Calico Life Sciences LLC; REGENXBIO Inc.; I-Mab Biopharma; Genmab A/S; Janssen Biotech, Inc.; Genentech, Inc.; California Institute for Biomedical Research (Calibr), and BigHat Biosciences, Inc. The company was incorporated in 2012 and is headquartered in North Chicago, Illinois.",
    "Dividend Ex-Date": "Jan 15, 2024",
    "EPS": "2.72",
    "Forward Dividend": "6.20 (3.58%)",
    "Industry": "Drug Manufacturers - General",
    "Last Updated": "2024-02-14 09:00",
    "Market Cap": "305.95B",
    "Next Earnings Date": "Apr 25, 2024 - Apr 29, 2024",
    "PE Ratio": "63.71",
    "Sector": "Healthcare",
    "Stock Type": "Company",
    "Symbol": "ABBV",
    "Website": "https://www.abbvie.com",
    "Yahoo Chart URL": "https://finance.yahoo.com/quote/ABBV/chart?p=ABBV",
    "Yahoo Options URL": "https://finance.yahoo.com/quote/ABBV/options?p=ABBV",
    "Yahoo Summary URL": "https://finance.yahoo.com/quote/ABBV?p=ABBV",
    "Year Range": "130.96 - 175.91"
}