{
    "Average Volume": "3,706,567",
    "Description": "American International Group, Inc. offers insurance products for commercial, institutional, and individual customers in North America and internationally. It operates through three segments: General Insurance, Life and Retirement, and Other Operations. The General Insurance segment provides commercial and industrial property insurance, including business interruption and package insurance that cover exposure to made and natural disasters; general liability, environmental, commercial automobile liability, workers' compensation, excess casualty, and crisis management insurance products; and professional liability insurance. This segment offers marine, energy-related property insurance, aviation, political risk, trade credit, trade finance, and portfolio solutions, as well as operates reinsurance business; voluntary and sponsor-paid personal accident, and supplemental health products; and personal auto and personal property insurance. Its Life and Retirement segment offers individual retirement products, including variable, fixed index, and fixed annuities, as well as retail mutual funds; group retirement products comprising record-keeping, plan administrative and compliance services, financial planning, and advisory solutions; life insurance, including term and universal life insurance; and institutional markets products, which includes wrap products, structured settlement, pension risk transfer annuities, corporate and bank-owned life insurance, high net worth, and guaranteed investment contract products. It distributes its products through a network of brokers, agents, advisors, banks, and other distributors. The company was founded in 1919 and is headquartered in New York, New York.",
    "Dividend Ex-Date": "Mar 13, 2024",
    "EPS": "4.98",
    "Forward Dividend": "1.44 (2.03%)",
    "Industry": "Insurance - Diversified",
    "Last Updated": "2024-02-23 08:40",
    "Market Cap": "48.266B",
    "Next Earnings Date": "May 02, 2024 - May 06, 2024",
    "PE Ratio": "14.23",
    "Sector": "Financial Services",
    "Stock Type": "Company",
    "Symbol": "AIG",
    "Website": "https://www.aig.com",
    "Yahoo Chart URL": "https://finance.yahoo.com/quote/AIG/chart?p=AIG",
    "Yahoo Options URL": "https://finance.yahoo.com/quote/AIG/options?p=AIG",
    "Yahoo Summary URL": "https://finance.yahoo.com/quote/AIG?p=AIG",
    "Year Range": "45.66 - 73.28"
}