{
    "Average Volume": "5,980,752",
    "Description": "AstraZeneca PLC, a biopharmaceutical company, focuses on the discovery, development, manufacture, andcommercialization of prescription medicines. The company's marketed products include Calquence, Enhertu, Faslodex, Imfinzi, Iressa, Koselugo, Lumoxiti, Lynparza, Orpathys, Tagrisso, and Zoladex for oncology; Andexxa/Ondexxya, Atacand, Atacand HCT, Atacand Plus, Brilinta/Brilique, Bydureon/Byetta, BCise, Byetta, Crestor, Evrenzo, Farxiga/Forxiga, Komboglyze/Kombiglyze XR, Lokelma, Onglyza, Qtern, Xigduo/Xigduo, and Zestril XR for cardiovascular, renal, and metabolism diseases; Accolate, Accoleit, Vanticon, Bevespi Aerosphere, Breztri Aerosphere, Bricanyl Respules and Turbuhaler, Daliresp/Daxas, Duaklir Genuair, Fasenra, Pulmicort, Rhinocort, Saphnelo, Symbicort, and Tezspire for respiratory and immunology; and Kanuma, Soliris, Strensiq, and Ultomiris for rare diseases. Its marketed products also comprise Synagis for respiratory syncytial virus; Fluenz Tetra/FluMist Quadrivalent for Influenza; and Vaxzevria and Evusheld for covid-19. The company serves primary care and specialty care physicians through distributors and local representative offices in the United Kingdom, rest of Europe, the Americas, Asia, Africa, and Australasia. It has a collaboration agreement with Neurimmune AG to develop and commercialize NI006; and Personalis, Inc, as well as research collaboration with Sernova Corp. to evaluate novel potential therapeutic cell applications; and collaboration with Cholesgen (Shanghai) Co.Ltd. to advance research and development in hypercholesterolemia and related metabolic diseases, as well as a collaboration with BioCity Biopharma to evaluate a monoclonal antibody for the treatment of advanced hepatocellular carcinoma and a collaboration agreement with Cellectis. The company was formerly known as Zeneca Group PLC and changed its name to AstraZeneca PLC in April 1999. AstraZeneca PLC was incorporated in 1992 and is headquartered in Cambridge, the United Kingdom.",
    "Dividend Ex-Date": "Aug 10, 2023",
    "EPS": "1.91",
    "Forward Dividend": "1.45 (2.28%)",
    "Industry": "Drug Manufacturers - General",
    "Last Updated": "2024-02-12 09:44",
    "Market Cap": "190.208B",
    "Next Earnings Date": "N/A",
    "PE Ratio": "32.12",
    "Sector": "Healthcare",
    "Stock Type": "Company",
    "Symbol": "AZN",
    "Website": "https://www.astrazeneca.com",
    "Yahoo Chart URL": "https://finance.yahoo.com/quote/AZN/chart?p=AZN",
    "Yahoo Options URL": "https://finance.yahoo.com/quote/AZN/options?p=AZN",
    "Yahoo Summary URL": "https://finance.yahoo.com/quote/AZN?p=AZN",
    "Year Range": "60.92 - 76.56"
}