{
    "Average Volume": "10,703,938",
    "Description": "AstraZeneca PLC discovers, develops, manufactures, and commercializes prescription medicines in the areas of oncology, cardiovascular, renal and metabolism, respiratory, infection, neuroscience, and gastroenterology worldwide. The company's marketed products include Tagrisso, Lynparza, Imfinzi, Enhertu, Koselugo, Lumoxiti, Equidacent, Zoladex, Faslodex, Iressa, Arimidex, Casodex/Cosudex, and others for oncology diseases; Onglyza, Bydureon, Lokelma, Byetta, Qtern, Symlin, and others for cardiovascular, renal, and metabolism diseases; and Symbicort, Pulmicort, Fasenra, Daliresp/Daxas, Duaklir, Tudorza/Eklira, Bevespi, Breztri, Anifrolumab, and others for respiratory and immunology diseases. It also offers other medicines and COVID-19 products, including Synagis, Fluenz Tetra/FluMist Quadrivalent, Seroquel IR/Seroquel XR, Vimovo, Movantik/Moventig, Nexium, Losec/Prilosec, and COVID-19 Vaccine AstraZeneca. The company serves primary care and specialty care physicians through distributors and local representative offices. It has a collaboration agreement with Daiichi Sankyo to develop and commercialize DS-1062 for the treatment of trophoblast cell-surface antigen 2 (TROP2) tumor; AliveCor, Inc. to develop non-invasive potassium monitoring solutions; Massachusetts General Hospital to accelerate digital health solutions; Sanguina on smartphone application study for hemoglobin management in patients with anemia of chronic kidney disease; Alchemab to enhance prostate cancer research; and Proteros biostructures GmbH to discover and develop novel small molecules for the treatment of various types of cancer. The company was formerly known as Zeneca Group PLC and changed its name to AstraZeneca PLC in April 1999. AstraZeneca PLC was incorporated in 1992 and is headquartered in Cambridge, the United Kingdom.",
    "Dividend Ex-Date": "Feb 25, 2021",
    "EPS": "1.52",
    "Forward Dividend": "1.40 (2.34%)",
    "Industry": "Drug Manufacturers—General",
    "Last Updated": "2021-08-10 11:07",
    "Market Cap": "148.578B",
    "Next Earnings Date": "N/A",
    "PE Ratio": "37.19",
    "Sector": "Healthcare",
    "Stock Type": "Company",
    "Symbol": "AZN",
    "Website": "http://www.astrazeneca.com",
    "Yahoo Chart URL": "https://finance.yahoo.com/quote/AZN/chart?p=AZN",
    "Yahoo Options URL": "https://finance.yahoo.com/quote/AZN/options?p=AZN",
    "Yahoo Summary URL": "https://finance.yahoo.com/quote/AZN?p=AZN",
    "Year Range": "46.48 - 60.93"
}