{
    "Average Volume": "3,848,485",
    "Description": "Baxter International Inc., through its subsidiaries, develops and provides a portfolio of healthcare products worldwide. The company operates through four segments: Medical Products and Therapies, Healthcare Systems and Technologies, Pharmaceuticals, and Kidney Care. The company offers sterile intravenous (IV) solutions; infusion systems and devices; parenteral nutrition therapies; generic injectable pharmaceuticals; surgical hemostat and sealant products, advanced surgical equipment; smart bed systems; patient monitoring and diagnostic technologies; and respiratory health devices, as well as advanced equipment for the surgical space, including surgical video technologies, precision positioning devices, and other accessories. It also provides administrative sets; adhesion prevention products; inhaled anesthesia; drug compounding; chronic and acute dialysis therapies and services, including peritoneal dialysis (PD), hemodialysis (HD), continuous renal replacement therapies (CRRT), and other organ support therapies. The company's products are used in hospitals, kidney dialysis centers, nursing homes, rehabilitation centers, ambulatory surgery centers, doctors' offices, and patients at home under physician supervision. The company sells its products through direct sales force, as well as through independent distributors, drug wholesalers, and specialty pharmacy or other alternate site providers in approximately 100 countries. It has an agreement with Celerity Pharmaceutical, LLC to develop acute care generic injectable premix and oncolytic products; and a collaborative research agreement with Miromatrix Medical Inc. aiming to advance care for patients with acute liver failure. Baxter International Inc. was incorporated in 1931 and is headquartered in Deerfield, Illinois.",
    "Dividend Ex-Date": "Nov 30, 2023",
    "EPS": "-0.15",
    "Forward Dividend": "1.16 (2.93%)",
    "Industry": "Medical Instruments & Supplies",
    "Last Updated": "2024-02-12 09:44",
    "Market Cap": "20.469B",
    "Next Earnings Date": "Apr 25, 2024 - Apr 29, 2024",
    "PE Ratio": "N/A",
    "Sector": "Healthcare",
    "Stock Type": "Company",
    "Symbol": "BAX",
    "Website": "https://www.baxter.com",
    "Yahoo Chart URL": "https://finance.yahoo.com/quote/BAX/chart?p=BAX",
    "Yahoo Options URL": "https://finance.yahoo.com/quote/BAX/options?p=BAX",
    "Yahoo Summary URL": "https://finance.yahoo.com/quote/BAX?p=BAX",
    "Year Range": "31.01 - 50.21"
}