{
    "Average Volume": "2,940,837",
    "Description": "Caterpillar Inc. manufactures and sells construction and mining equipment, off-highway diesel and natural gas engines, industrial gas turbines, and diesel-electric locomotives in the United States and internationally. Its Construction Industries segment offers asphalt pavers, compactors, road reclaimers, forestry machines, cold planers, material handlers, tractors, excavators, telehandlers, motor graders, and pipelayers; compact track and multi-terrain, wheel, track-type, backhoe, and skid steer loaders; and related parts and tools. The company's Resource Industries segment provides electric rope and hydraulic shovels, draglines, rotary drills, hard rock vehicles, tractors, mining trucks, longwall miners, wheel loaders, off-highway and articulated trucks, wheel tractor scrapers and dozers, fleet management products, landfill and soil compactors, machinery components, autonomous ready vehicles and solutions, work tools, and safety services and mining performance solutions, as well as related parts and services. Its Energy & Transportation segment offers reciprocating engine powered generator sets; reciprocating engines, drivetrain, and integrated systems and solutions; turbines, centrifugal gas compressors, and related services; and diesel-electric locomotives and components, and other rail-related products. The company's Financial Products segment provides operating and finance leases, installment sale contracts, repair/rebuild financing services, working capital loans, and wholesale financing; and insurance and risk management products and services. Its All Other operating segment offers filters and fluids, undercarriage, ground engaging tools, fluid transfer products, precision seals, and rubber sealing and connecting components; parts distribution; integrated logistics solutions and distribution services; brand management and marketing strategy services; and digital investments services. Caterpillar Inc. was founded in 1925 and is headquartered in Irving, Texas.",
    "Dividend Ex-Date": "Jan 19, 2024",
    "EPS": "20.11",
    "Forward Dividend": "5.20 (1.64%)",
    "Industry": "Farm & Heavy Construction Machinery",
    "Last Updated": "2024-02-12 09:50",
    "Market Cap": "164.36B",
    "Next Earnings Date": "Apr 25, 2024 - Apr 29, 2024",
    "PE Ratio": "15.81",
    "Sector": "Industrials",
    "Stock Type": "Company",
    "Symbol": "CAT",
    "Website": "https://www.caterpillar.com",
    "Yahoo Chart URL": "https://finance.yahoo.com/quote/CAT/chart?p=CAT",
    "Yahoo Options URL": "https://finance.yahoo.com/quote/CAT/options?p=CAT",
    "Yahoo Summary URL": "https://finance.yahoo.com/quote/CAT?p=CAT",
    "Year Range": "204.04 - 334.87"
}