{
    "Average Volume": "4,061,522",
    "Description": "Colgate-Palmolive Company, together with its subsidiaries, manufactures and sells consumer products worldwide. The company operates through two segments, Oral, Personal and Home Care; and Pet Nutrition. The Oral, Personal and Home Care segment's products include toothpaste, toothbrushes, mouthwash, bar and liquid hand soaps, shower gels, shampoos, conditioners, deodorants and antiperspirants, skin health products, dishwashing detergents, fabric conditioners, household cleaners, and other similar items. This segment markets and sells its products to various retailers, wholesalers, and distributors. The Pet Nutrition segment offers pet nutrition products for everyday nutritional needs; and a range of therapeutic products to manage disease conditions in dogs and cats. This segment markets and sells its products through pet supply retailers, veterinarians, and eCommerce retailers. Its principal global and regional trademarks include Colgate, Palmolive, elmex, hello, meridol, Sorriso, Tom's of Maine, EltaMD, Filorga, Irish Spring, Lady Speed Stick, PCA Skin, Protex, Sanex, Softsoap, Speed Stick, Ajax, Axion, Fabuloso, Murphy, Soupline, and Suavitel, as well as Hill's Science Diet and Hill's Prescription Diet. Colgate-Palmolive Company was founded in 1806 and is headquartered in New York, New York.",
    "Dividend Ex-Date": "Jul 20, 2021",
    "EPS": "3.11",
    "Forward Dividend": "1.80 (2.21%)",
    "Industry": "Household & Personal Products",
    "Last Updated": "2021-08-10 11:06",
    "Market Cap": "66.299B",
    "Next Earnings Date": "Oct 28, 2021 - Nov 01, 2021",
    "PE Ratio": "25.20",
    "Sector": "Consumer Defensive",
    "Stock Type": "Company",
    "Symbol": "CL",
    "Website": "http://www.colgatepalmolive.com",
    "Yahoo Chart URL": "https://finance.yahoo.com/quote/CL/chart?p=CL",
    "Yahoo Options URL": "https://finance.yahoo.com/quote/CL/options?p=CL",
    "Yahoo Summary URL": "https://finance.yahoo.com/quote/CL?p=CL",
    "Year Range": "74.14 - 86.41"
}