{
    "Average Volume": "18,111,313",
    "Description": "Comcast Corporation operates as a media and technology company worldwide. It operates through Residential Connectivity & Platforms, Business Services Connectivity, Media, Studios, and Theme Parks segments. The Residential Connectivity & Platforms segment provides residential broadband and wireless connectivity services, residential and business video services, sky-branded entertainment television networks, and advertising. The Business Services Connectivity segment offers connectivity services for small business locations, which include broadband, wireline voice, and wireless services, as well as solutions for medium-sized customers and larger enterprises; and small business connectivity services in the United Kingdom. The Media segment operates NBCUniversal's television and streaming business, including national and regional cable networks; the NBC and Telemundo broadcast networks and owned local broadcast television stations; and Peacock, a direct-to-consumer streaming services. It also operates international television networks comprising the Sky Sports networks, as well as other digital properties. The Studios segment operates NBCUniversal and Sky film and television studio production and distribution operations. The Theme Parks segment operates Universal theme parks in Orlando, Florida; Hollywood, California; Osaka, Japan; and Beijing, China. The company also offers a consolidated streaming platforms under the Philadelphia Flyers and the Wells Fargo Center arena in Philadelphia, Pennsylvania; and Xumo. Comcast Corporation was founded in 1963 and is headquartered in Philadelphia, Pennsylvania.",
    "Dividend Ex-Date": "Apr 02, 2024",
    "EPS": "3.71",
    "Forward Dividend": "1.24 (2.76%)",
    "Industry": "Telecom Services",
    "Last Updated": "2024-02-06 19:39",
    "Market Cap": "176.43B",
    "Next Earnings Date": "Apr 25, 2024 - Apr 29, 2024",
    "PE Ratio": "11.97",
    "Sector": "Communication Services",
    "Stock Type": "Company",
    "Symbol": "CMCSA",
    "Website": "https://corporate.comcast.com",
    "Yahoo Chart URL": "https://finance.yahoo.com/quote/CMCSA/chart?p=CMCSA",
    "Yahoo Options URL": "https://finance.yahoo.com/quote/CMCSA/options?p=CMCSA",
    "Yahoo Summary URL": "https://finance.yahoo.com/quote/CMCSA?p=CMCSA",
    "Year Range": "34.63 - 47.46"
}