{
    "Average Volume": "10,662,727",
    "Description": "CVS Health Corporation provides health solutions in the United States. It operates through Health Care Benefits, Health Services, and Pharmacy & Consumer Wellness segments. The Health Care Benefits segment offers traditional, voluntary, and consumer-directed health insurance products and related services. It serves employer groups, individuals, college students, part-time and hourly workers, health plans, health care providers, governmental units, government-sponsored plans, labor groups, and expatriates. The Health Services segment offers pharmacy benefit management solutions, including plan design and administration, formulary management, retail pharmacy network management, mail order pharmacy, specialty pharmacy and infusion, clinical, and disease and medical spend management services. It serves employers, insurance companies, unions, government employee groups, health plans, prescription drug plans, Medicaid managed care plans, CMS, plans offered on public health insurance and private health insurance exchanges, other sponsors of health benefit plans, and individuals. The Pharmacy & Consumer Wellness segment sells prescription and over-the-counter drugs, consumer health and beauty products, and personal care products. This segment also distributes prescription drugs; and provides related pharmacy consulting and other ancillary services to care facilities and other care settings. It operates online retail pharmacy websites, LTC pharmacies and on-site pharmacies, retail specialty pharmacy stores, compounding pharmacies and branches for infusion and enteral nutrition services. The company was formerly known as CVS Caremark Corporation and changed its name to CVS Health Corporation in September 2014. CVS Health Corporation was incorporated in 1996 and is headquartered in Woonsocket, Rhode Island.",
    "Dividend Ex-Date": "Jan 19, 2024",
    "EPS": "6.47",
    "Forward Dividend": "2.66 (3.49%)",
    "Industry": "Healthcare Plans",
    "Last Updated": "2024-02-12 09:47",
    "Market Cap": "95.781B",
    "Next Earnings Date": "May 01, 2024 - May 06, 2024",
    "PE Ratio": "11.76",
    "Sector": "Healthcare",
    "Stock Type": "Company",
    "Symbol": "CVS",
    "Website": "https://www.cvshealth.com",
    "Yahoo Chart URL": "https://finance.yahoo.com/quote/CVS/chart?p=CVS",
    "Yahoo Options URL": "https://finance.yahoo.com/quote/CVS/options?p=CVS",
    "Yahoo Summary URL": "https://finance.yahoo.com/quote/CVS?p=CVS",
    "Year Range": "64.41 - 90.58"
}