{
    "Average Volume": "685,123",
    "Description": "Cryoport, Inc., a life sciences services company, provides temperature-controlled logistics solutions in the Americas, Europe, the Middle East, Africa, and the Asia Pacific. The company offers Cryoportal, a cloud-based logistics management platform that supports the management of shipments, which includes order entry, document preparation, customs documentation, courier management, real-time shipment tracking and monitoring, issue resolution, and regulatory compliance requirements; and CryoPort Express Shippers, which is used to ensure that the stability of shipped biologic commodities are maintained throughout the shipping cycle; and Cryoport Express Advanced Therapy Shippers that provides verification processes to biopharma companies. It also provides information dashboards and validation documentation for shipments through data collected by the SmartPak Condition Monitoring System; and vacuum insulated aluminum dewars and cryogenic freezers systems. In addition, the company offers biological specimen cryopreservation storage and maintenance; archiving, monitoring, tracking, receipt, and delivery of samples; transportation of frozen biological specimens to and from customer locations; and management of incoming and outgoing biological specimens, as well as provides logistics support and management; and short-term logistics and engineering consulting services. It serves biopharma/pharma, animal health, and human reproductive medicine markets. The company was founded in 1999 and is headquartered in Brentwood, Tennessee.",
    "Dividend Ex-Date": "N/A",
    "EPS": "-1.95",
    "Forward Dividend": "N/A (N/A)",
    "Industry": "Integrated Freight & Logistics",
    "Market Cap": "2.58B",
    "Next Earnings Date": "Aug 04, 2021 - Aug 09, 2021",
    "PE Ratio": "N/A",
    "Sector": "Industrials",
    "Stock Type": "Company",
    "Symbol": "CYRX",
    "Website": "http://www.cryoport.com",
    "Year Range": "15.90 - 84.97"
}