{
    "Average Volume": "5,792,926",
    "Description": "3D Systems Corporation, through its subsidiaries, provides 3D printing and digital manufacturing solutions in the Americas, Europe, the Middle East, Africa, and the Asia Pacific. The company offers 3D printers, such as stereolithography, selective laser sintering, direct metal printing, multi jet printing, and color jet printers that transform digital data input generated by 3D design software, computer aided design (CAD) software, or other 3D design tools into printed parts under the Accura, DuraForm, LaserForm, CastForm, and VisiJet brand names. It also develops, blends, and markets various print materials, such as plastic, nylon, metal, composite, elastomeric, wax, polymeric dental, and Class IV bio-compatible materials. In addition, the company provides digital design tools, including software, scanners, and haptic devices, as well as solutions for product design, mold and die design, 3D scan-to-print, reverse engineering, production machining, metrology, and inspection under the Geomagic brand. Further, it offers 3D Sprint and 3DXpert, a proprietary software to prepare and optimize CAD data and manage the additive manufacturing processes, which provides automated support building and placement, build platform management, and print queue management; and 3D virtual reality simulators and simulator modules for medical applications under the Simbionix brand, and digitizing scanners for medical and mechanical applications. Additionally, the company provides warranty, maintenance, and training services; on-demand manufacturing solutions; and software and precision healthcare services. It primarily serves companies and small and midsize businesses in medical, dental, automotive, aerospace, durable good, government, defense, technology, jewelry, electronic, education, consumer good, energy, and other industries through direct sales force, as well as partner channels and distributors. The company was founded in 1986 and is headquartered in Rock Hill, South Carolina.",
    "Dividend Ex-Date": "N/A",
    "EPS": "-0.48",
    "Forward Dividend": "N/A (N/A)",
    "Industry": "Computer Hardware",
    "Last Updated": "2021-08-18 12:59",
    "Market Cap": "3.662B",
    "Next Earnings Date": "Nov 03, 2021 - Nov 08, 2021",
    "PE Ratio": "N/A",
    "Sector": "Technology",
    "Stock Type": "Company",
    "Symbol": "DDD",
    "Website": "http://www.3dsystems.com",
    "Yahoo Chart URL": "https://finance.yahoo.com/quote/DDD/chart?p=DDD",
    "Yahoo Options URL": "https://finance.yahoo.com/quote/DDD/options?p=DDD",
    "Yahoo Summary URL": "https://finance.yahoo.com/quote/DDD?p=DDD",
    "Year Range": "4.60 - 56.50"
}