{
    "Average Volume": "1,258,182",
    "Description": "8x8, Inc. provides voice, video, chat, contact center, and enterprise-class application programmable interface (API) Software-as-a-Service solutions for small and mid-size businesses, mid-market and larger enterprises, government agencies, and other organizations worldwide. It offers unified communications, team collaboration, video conferencing, contact center, data and analytics, communication APIs, and other services. The company provides 8x8 Work, a self-contained end-to-end united communications solution that delivers enterprise voice with public switched telephone network connectivity, video meetings, and unified messaging; 8x8 Contact Center, a multi-channel cloud-based contact center solution; and 8x8 Meet, a cloud-based video conferencing and collaboration solution that enables secure and continuous collaboration with borderless high definition video and audio communications from mobile and desktop devices. It also offers 8x8 Team Messaging, an integrated open team messaging platform, which facilitate modern modes of communication with support for direct messages, public and private team messaging rooms, short messaging service, presence, emojis, and Â\u0091@ mentions'; 8x8 CPaaS, a set of global communications Platform-as-a-Service; and X1 through X4 and X5 through X8, which provide enterprise-grade voice, unified communications, and video meetings and team collaboration, and contact centre solutions. The company markets its services to end users through search engine marketing and optimization, third-party lead generation sources, industry conferences, trade shows, Webinars, and digital advertising channels, as well as direct sales organization. 8x8, Inc. was incorporated in 1987 and is headquartered in Campbell, California.",
    "Dividend Ex-Date": "N/A",
    "EPS": "-1.56",
    "Forward Dividend": "N/A (N/A)",
    "Industry": "Software—Application",
    "Last Updated": "2021-08-10 11:03",
    "Market Cap": "2.805B",
    "Next Earnings Date": "Oct 26, 2021 - Nov 01, 2021",
    "PE Ratio": "N/A",
    "Sector": "Technology",
    "Stock Type": "Company",
    "Symbol": "EGHT",
    "Website": "http://www.8x8.com",
    "Yahoo Chart URL": "https://finance.yahoo.com/quote/EGHT/chart?p=EGHT",
    "Yahoo Options URL": "https://finance.yahoo.com/quote/EGHT/options?p=EGHT",
    "Yahoo Summary URL": "https://finance.yahoo.com/quote/EGHT?p=EGHT",
    "Year Range": "14.71 - 39.17"
}