{
    "Average Volume": "2,834,152",
    "Description": "Emerson Electric Co., a technology and software company, provides various solutions for customers in industrial, commercial, and consumer markets in the Americas, Asia, the Middle East, Africa, and Europe. It operates in six segments: Final Control, Control Systems & Software, Measurement & Analytical, AspenTech, Discrete Automation, and Safety & Productivity. The Final Control segment provides control, isolation, shutoff, pressure relief, and pressure safety valves, actuators, and regulators for process and hybrid industries. The Measurement & Analytical segment offers intelligent instrumentation measuring the physical properties of liquids or gases, such as pressure, temperature, level, flow, acoustics, corrosion, pH, conductivity, water quality, toxic gases, and flame. The Discrete Automation segment offers solenoid and pneumatic valves, valve position indicators, pneumatic cylinders, air preparation equipment, pressure and temperature switches, electric linear motion solutions, programmable automation control systems, electrical distribution equipment, and materials joining solutions. The Safety & Productivity segment offers tools for professionals and homeowners; pipe-working tools, including pipe wrenches, pipe cutters, pipe threading and roll grooving equipment, battery hydraulic tools; electrical tools; and other professional tools. The Control Systems & Software segment provides distributed control systems, safety instrumented systems, SCADA systems, application software, digital twins, asset performance management, and cybersecurity. The Test & Measurement provides software-connected automated test and measurement systems. The AspenTech segment provides asset optimization software that enables industrial manufacturers to design, operate, and maintain operations for enhancing performance through a combination of decades of modeling, simulation, and optimization capabilities. The company was incorporated in 1890 and is headquartered in Saint Louis, Missouri.",
    "Dividend Ex-Date": "Feb 15, 2024",
    "EPS": "3.41",
    "Forward Dividend": "2.10 (2.03%)",
    "Industry": "Specialty Industrial Machinery",
    "Last Updated": "2024-02-12 09:47",
    "Market Cap": "59.119B",
    "Next Earnings Date": "May 01, 2024 - May 06, 2024",
    "PE Ratio": "30.33",
    "Sector": "Industrials",
    "Stock Type": "Company",
    "Symbol": "EMR",
    "Website": "https://www.emerson.com",
    "Yahoo Chart URL": "https://finance.yahoo.com/quote/EMR/chart?p=EMR",
    "Yahoo Options URL": "https://finance.yahoo.com/quote/EMR/options?p=EMR",
    "Yahoo Summary URL": "https://finance.yahoo.com/quote/EMR?p=EMR",
    "Year Range": "76.94 - 105.71"
}