{
    "Average Volume": "1,851,377",
    "Description": "Herbalife Ltd. provides health and wellness products in North America, Mexico, South and Central America, Europe, the Middle East, Africa, China, and the Asia Pacific. It offers products in the areas of weight management; targeted nutrition; energy, sports, and fitness; outer nutrition; and literature and promotional items. The company also provides weight management products, including meal replacement products, protein shakes, drink mixes, weight loss supplements, healthy snacks, and metabolism boosting teas; targeted nutrition products, which comprise functional beverages, and dietary and nutritional supplements that contain herbs, vitamins, minerals, and other natural ingredients; outer nutrition products, such as facial skin, body, and hair care products; and energy, sports, and fitness products, including N-R-G tea and energy drink products. In addition, it offers literature, promotional, and other materials that comprise start-up kits, sales tools, and educational materials. The company sells its products through sales representatives, independent service providers, and company-operated retail platforms. Herbalife Ltd. was formerly known as Herbalife Nutrition Ltd. and changed its name to Herbalife Ltd. in April 2023. The company was founded in 1980 and is headquartered in Los Angeles, California.",
    "Dividend Ex-Date": "Feb 28, 2014",
    "EPS": "1.42",
    "Forward Dividend": "N/A (N/A)",
    "Industry": "Packaged Foods",
    "Last Updated": "2024-02-23 08:42",
    "Market Cap": "843.725M",
    "Next Earnings Date": "Apr 30, 2024 - May 06, 2024",
    "PE Ratio": "5.99",
    "Sector": "Consumer Defensive",
    "Stock Type": "Company",
    "Symbol": "HLF",
    "Website": "https://www.herbalife.com",
    "Yahoo Chart URL": "https://finance.yahoo.com/quote/HLF/chart?p=HLF",
    "Yahoo Options URL": "https://finance.yahoo.com/quote/HLF/options?p=HLF",
    "Yahoo Summary URL": "https://finance.yahoo.com/quote/HLF?p=HLF",
    "Year Range": "6.68 - 20.79"
}