{
    "Average Volume": "1,822,534",
    "Description": "Infinera Corporation provides optical transport networking equipment, software, and services worldwide. The company's product portfolio includes Infinera Groove series for modular and sled-based platforms to support a various transport network applications; Infinera 7300 series, an SDN-ready coherent optical transport system; Infinera FlexILS open optical line system that connects various Infinera and third-party terminal equipment platforms over long-distance fiber optic cable providing switching, multiplexing, amplification, and management channels; and Infinera 7090 and 7100 series for transport platforms. It also offers Infinera XTM series, a packet-optical transport platform that enables metro connectivity solutions; Infinera XTC series, a multi-terabit packet optical transport platforms that integrates digital OTN switching and optical WDM transmission; Infinera mTera series, a network transport solution; and Infinera XT series, a platform that is designed to power cloud scale network services over metro, DCI, long-haul, and subsea networks. The company provides Infinera Cloud Xpress Family that is designed to meet the needs of internet content providers (ICPs), communication service providers, internet exchange service providers, enterprises, and other large-scale data center operators; Infinera DRX series for routers; and Infinera 8600 series for SDN-ready Internet Protocol/MPLS routers. It also offers Infinera CNOS, a hardware-independent network operating system; Transcend software suite; and system software and customer support services. The company also serves telecommunications service providers, ICPs, cable providers, wholesale carriers, research and education institutions, large enterprises, and government entities. It markets and sells its products and related support services primarily through its direct sales force. The company was formerly known as Zepton Networks. The company was incorporated in 2000 and is headquartered in San Jose, California.",
    "Dividend Ex-Date": "N/A",
    "EPS": "-0.65",
    "Forward Dividend": "N/A (N/A)",
    "Industry": "Communication Equipment",
    "Last Updated": "2021-08-10 11:04",
    "Market Cap": "1.916B",
    "Next Earnings Date": "Nov 03, 2021 - Nov 08, 2021",
    "PE Ratio": "N/A",
    "Sector": "Technology",
    "Stock Type": "Company",
    "Symbol": "INFN",
    "Website": "http://www.infinera.com",
    "Yahoo Chart URL": "https://finance.yahoo.com/quote/INFN/chart?p=INFN",
    "Yahoo Options URL": "https://finance.yahoo.com/quote/INFN/options?p=INFN",
    "Yahoo Summary URL": "https://finance.yahoo.com/quote/INFN?p=INFN",
    "Year Range": "5.76 - 11.51"
}