{
    "Average Volume": "4,750,066",
    "Description": "Johnson Controls International plc operates as a diversified technology and multi industrial company worldwide. It operates through Building Solutions North America, Building Solutions EMEA/LA, Building Solutions Asia Pacific, and Global Products segments. The company designs, sells, installs, and services heating, ventilating, air conditioning, controls, refrigeration, integrated electronic security, and integrated fire detection and suppression systems for commercial, industrial, retail, small business, institutional, and governmental customers; and energy efficiency solutions and technical services, including inspection, scheduled maintenance, and repair and replacement of mechanical and control systems, as well as data-driven smart building solutions to non-residential building and industrial applications. It also designs and produces heating and air conditioning for residential and commercial applications; and markets products and refrigeration systems to replacement and new construction market; and designs, manufactures, and sells fire protection and security products, including intrusion security, anti-theft devices, and access control and video management systems for commercial, industrial, retail, residential, small business, institutional, and governmental customers. The company was formerly known as Johnson Controls, Inc. and changed its name to Johnson Controls International plc in September 2016. Johnson Controls International plc was founded in 1885 and is headquartered in Cork, Ireland.",
    "Dividend Ex-Date": "Mar 19, 2021",
    "EPS": "1.44",
    "Forward Dividend": "1.08 (1.70%)",
    "Industry": "Engineering & Construction",
    "Last Updated": "2021-05-12 14:51",
    "Market Cap": "45.619B",
    "Next Earnings Date": "Jul 29, 2021 - Aug 02, 2021",
    "PE Ratio": "44.20",
    "Sector": "Industrials",
    "Stock Type": "Company",
    "Symbol": "JCI",
    "Website": "http://www.johnsoncontrols.com",
    "Year Range": "26.23 - 64.41"
}