{
    "Average Volume": "861,196",
    "Description": "McKesson Corporation provides healthcare services in the United States and internationally. It operates through four segments: U.S. Pharmaceutical, Prescription Technology Solutions (RxTS), Medical-Surgical Solutions, and International. The U.S. Pharmaceutical segment distributes branded, generic, specialty, biosimilar and over-the-counter pharmaceutical drugs, and other healthcare-related products. This segment also provides practice management, technology, clinical support, and business solutions to community-based oncology and other specialty practices; and consulting, outsourcing, technological, and other services, as well as sells financial, operational, and clinical solutions to pharmacies. The RxTS segment serves biopharma and life sciences partners and patients to address medication challenges for patients by working across healthcare; connects patients, pharmacies, providers, pharmacy benefit managers, health plans, and biopharma companies to deliver innovative solutions to help people get the medicine needed to live healthier lives; and provides prescription price transparency, benefit insight, dispensing support, third-party logistics, and wholesale distribution support services. The Medical-Surgical Solutions segment provides medical-surgical supply distribution, logistics, and other services to healthcare providers, including physician offices, surgery centers, nursing homes, hospital reference labs, and home health care agencies. The International segment offers distribution and services to wholesale, institutional, and retail customers in Europe and Canada. McKesson Corporation was founded in 1833 and is headquartered in Irving, Texas.",
    "Dividend Ex-Date": "Feb 29, 2024",
    "EPS": "22.11",
    "Forward Dividend": "2.48 (0.49%)",
    "Industry": "Medical Distribution",
    "Last Updated": "2024-02-12 09:47",
    "Market Cap": "65.293B",
    "Next Earnings Date": "May 06, 2024 - May 10, 2024",
    "PE Ratio": "22.53",
    "Sector": "Healthcare",
    "Stock Type": "Company",
    "Symbol": "MCK",
    "Website": "https://www.mckesson.com",
    "Yahoo Chart URL": "https://finance.yahoo.com/quote/MCK/chart?p=MCK",
    "Yahoo Options URL": "https://finance.yahoo.com/quote/MCK/options?p=MCK",
    "Yahoo Summary URL": "https://finance.yahoo.com/quote/MCK?p=MCK",
    "Year Range": "331.75 - 519.75"
}