{
    "Average Volume": "3,076,654",
    "Description": "Marathon Petroleum Corporation, together with its subsidiaries, operates as an integrated downstream energy company primarily in the United States. It operates in two segments, Refining & Marketing, and Midstream. The Refining & Marketing segment refines crude oil and other feedstocks at its refineries in the Gulf Coast, Mid-Continent, and West Coast regions of the United States; and purchases refined products and ethanol for resale and distributes refined products, including renewable diesel, through transportation, storage, distribution, and marketing services. Its refined products include transportation fuels, such as reformulated gasolines and blend-grade gasolines; heavy fuel oil; and asphalt. This segment also manufactures propane, petrochemicals, and natural gas liquids. It sells refined products to wholesale marketing customers in the United States and internationally, buyers on the spot market, and independent entrepreneurs who operate primarily Marathon branded outlets, as well as through long-term fuel supply contracts to direct dealer locations primarily under the ARCO brand. The Midstream segment transports, stores, distributes, and markets crude oil and refined products through refining logistics assets, pipelines, terminals, towboats, and barges; gathers, processes, and transports natural gas; and gathers, transports, fractionates, stores, and markets natural gas liquids. The company was founded in 1887 and is headquartered in Findlay, Ohio.",
    "Dividend Ex-Date": "Feb 20, 2024",
    "EPS": "23.63",
    "Forward Dividend": "3.30 (1.94%)",
    "Industry": "Oil & Gas Refining & Marketing",
    "Last Updated": "2024-02-12 09:55",
    "Market Cap": "62.737B",
    "Next Earnings Date": "Apr 30, 2024 - May 06, 2024",
    "PE Ratio": "7.21",
    "Sector": "Energy",
    "Stock Type": "Company",
    "Symbol": "MPC",
    "Website": "https://www.marathonpetroleum.com",
    "Yahoo Chart URL": "https://finance.yahoo.com/quote/MPC/chart?p=MPC",
    "Yahoo Options URL": "https://finance.yahoo.com/quote/MPC/options?p=MPC",
    "Yahoo Summary URL": "https://finance.yahoo.com/quote/MPC?p=MPC",
    "Year Range": "104.32 - 173.33"
}