{
    "Average Volume": "3,896,890",
    "Description": "Moderna, Inc., a biotechnology company, discovers, develops, and commercializes messenger RNA therapeutics and vaccines for the treatment of infectious diseases, immuno-oncology, rare diseases, autoimmune, and cardiovascular diseases in the United States, Europe, and internationally. Its respiratory vaccines include COVID-19, influenza, and respiratory syncytial virus, spikevax, and hMPV/PIV3 vaccines; latent vaccines comprise cytomegalovirus, epstein-barr virus, herpes simplex virus, varicella zoster virus, and human immunodeficiency virus vaccines; public health vaccines consists of Zika, Nipah, Mpox vaccines; and infectious diseases vaccines, such as lyme and norovirus vaccines. The company also offers systemic secreted and cell surface therapeutics; cancer vaccines, such as personalized cancer, KRAS, and checkpoint vaccines; intratumoral immuno-oncology products; rare disease intracellular therapeutics; and inhaled pulmonary therapeutics. It has strategic alliances and collaborations with AstraZeneca; Merck & Co., Inc; Vertex Pharmaceuticals Incorporated; Vertex Pharmaceuticals (Europe) Limited; Chiesi Farmaceutici S.p.A.; Metagenomi, Inc.; Carisma Therapeutics, Inc.; CytomX Therapeutics; Defense Advanced Research Projects Agency; Biomedical Advanced Research and Development Authority; Institute for Life Changing Medicines; and The Bill & Melinda Gates Foundation. The company was formerly known as Moderna Therapeutics, Inc. and changed its name to Moderna, Inc. in August 2018. Moderna, Inc. was founded in 2010 and is headquartered in Cambridge, Massachusetts.",
    "Dividend Ex-Date": "N/A",
    "EPS": "-12.33",
    "Forward Dividend": "N/A (N/A)",
    "Industry": "Biotechnology",
    "Last Updated": "2024-04-09 08:16",
    "Market Cap": "40.237B",
    "Next Earnings Date": "May 02, 2024 - May 06, 2024",
    "PE Ratio": "N/A",
    "Sector": "Healthcare",
    "Stock Type": "Company",
    "Symbol": "MRNA",
    "Website": "https://www.modernatx.com",
    "Yahoo Chart URL": "https://finance.yahoo.com/quote/MRNA/chart?p=MRNA",
    "Yahoo Options URL": "https://finance.yahoo.com/quote/MRNA/options?p=MRNA",
    "Yahoo Summary URL": "https://finance.yahoo.com/quote/MRNA?p=MRNA",
    "Year Range": "62.55 - 163.24"
}