{
    "Average Volume": "865,478",
    "Description": "Nektar Therapeutics operates as a biopharmaceutical company. The company researches and develops pipeline of investigational medicines in oncology, immunology, and virology, as well as a portfolio of approved partnered medicines. The company's products include Bempegaldesleukin, a CD122-preferential interleukin-2 (IL-2) pathway agonist, which is in phase 3 clinical trial to treat metastatic melanoma, renal cell carcinoma, muscle-invasive bladder cancer, and adjuvant melanoma; phase 2 clinical trial for the treatment of renal cell carcinoma and urothelial cancer; phase 1/2A clinical trial to treat squamous cell carcinoma of the head and neck; phase 1/2 clinical trial for the treatment of non-small cell lung cancer and immuno-oncology; and phase 1B clinical trial to treat COVID-19.It is also developing NKTR-358, a cytokine Treg stimulant that is in phase 2 clinical trial for the treatment of systemic lupus erythematosus and ulcerative colitis, as well as phase 1B clinical trial to treat atopic dermatitis and psoriasis; NKTR-255, an IL-15 receptor agonist, which is in phase 2 clinical trial for the treatment of non-Hodgkin's lymphoma and multiple myeloma, and head and neck cancer and colorectal cancer; and NKTR-262, a toll-like receptor agonist that is in phase 1/2 clinical trial to treat locally advanced or metastatic solid tumor malignancies, as well as various other drug candidates. The company has collaboration agreements with Takeda Pharmaceutical Company Ltd.; AstraZeneca AB; UCB Pharma S.A.; F. Hoffmann-La Roche Ltd; Bausch Health Companies Inc.; Pfizer Inc.; Amgen Inc.; UCB Pharma (Biogen); Bristol-Myers Squibb Company; Baxalta Incorporated; Eli Lilly and Company; Merck; and SFJ Pharmaceuticals, Inc. Nektar Therapeutics was incorporated in 1990 and is headquartered in San Francisco, California with additional operations in Huntsville, Alabama and Hyderabad, India.",
    "Dividend Ex-Date": "N/A",
    "EPS": "-2.63",
    "Forward Dividend": "N/A (N/A)",
    "Industry": "Biotechnology",
    "Last Updated": "2021-08-18 13:00",
    "Market Cap": "2.505B",
    "Next Earnings Date": "Nov 03, 2021 - Nov 08, 2021",
    "PE Ratio": "N/A",
    "Sector": "Healthcare",
    "Stock Type": "Company",
    "Symbol": "NKTR",
    "Website": "http://www.nektar.com",
    "Yahoo Chart URL": "https://finance.yahoo.com/quote/NKTR/chart?p=NKTR",
    "Yahoo Options URL": "https://finance.yahoo.com/quote/NKTR/options?p=NKTR",
    "Yahoo Summary URL": "https://finance.yahoo.com/quote/NKTR?p=NKTR",
    "Year Range": "13.40 - 26.75"
}