{
    "Average Volume": "15,792,675",
    "Description": "Nokia Oyj provides mobile, fixed, and cloud network solutions worldwide. The company operates through four segments: Network Infrastructure, Mobile Networks, Cloud and Network Services, and Nokia Technologies. It offers products and services for radio access networks and microwave radio links for transport networks, and solutions for network management, as well as network planning, optimization, network deployment, and technical support services. The company provides fixed networking solutions, such as fiber and copper-based access infrastructure, Wi-Fi in-home solutions, and cloud and virtualization services; IP networking solutions, including IP access, aggregation, and edge and core routing for residential, business, mobile, cloud, and digital industry applications, as well as software-defined WAN solutions; a portfolio of optical networks comprising portfolio coherent optical transponders, optical transport network switchers, wavelength-division multiplexers, reconfigurable optical add-drop multiplexer solutions, and optical line systems for metro, regional, long-haul and ultra-long-haul applications; and submarine networks. In addition, it offers cloud and network services, including core network solutions, such as voice and packet core; business applications, which covers security, automation, and monetization; cloud and cognitive services; and enterprise solutions covering private wireless and industrial automation. Further, the company provides hardware, software, and services, as well as licensing of intellectual property, including patents, technologies, and the Nokia brand. It serves communications service providers, webscales, hyperscalers, digital developer, partner, and government. Nokia Oyj was founded in 1865 and is headquartered in Espoo, Finland.",
    "Dividend Ex-Date": "Jan 29, 2024",
    "EPS": "0.1300",
    "Forward Dividend": "0.13 (3.67%)",
    "Industry": "Communication Equipment",
    "Last Updated": "2024-02-06 19:42",
    "Market Cap": "19.971B",
    "Next Earnings Date": "N/A",
    "PE Ratio": "27.38",
    "Sector": "Technology",
    "Stock Type": "Company",
    "Symbol": "NOK",
    "Website": "https://www.nokia.com",
    "Yahoo Chart URL": "https://finance.yahoo.com/quote/NOK/chart?p=NOK",
    "Yahoo Options URL": "https://finance.yahoo.com/quote/NOK/options?p=NOK",
    "Yahoo Summary URL": "https://finance.yahoo.com/quote/NOK?p=NOK",
    "Year Range": "2.9400 - 4.9700"
}