{
    "Average Volume": "35,859,390",
    "Description": "Nokia Corporation provides mobile and fixed network solutions worldwide. The company operates through four segments: Mobile Networks, Network Infrastructure, Cloud and Network Services, and Nokia Technologies. It focuses on mobile radio including macro radio, small cells, and cloud native radio solutions for communications service providers and enterprises; and provides network planning and optimization, network implementation, and systems integration, as well as company-wide managed services. The company also offers fixed networking solutions, such as copper and fiber access products, solutions, and services. In addition, it provides network infrastructure and professional services for mobile networks; and managed services for the fixed, mobile, Internet protocol (IP), and optical domains. Further, the company offers network planning, implementation, operation, and maintenance services. Additionally, it provides IP/optical networking solutions, including IP routing and optical transport systems, software, and services; software solutions, such as customer experience management, network operations and management, communications and collaborations, and policy and charging, as well as cloud, IoT, security, and analytics platforms; and submarine networks and radiofrequency systems. Nokia Corporation was founded in 1865 and is headquartered in Espoo, Finland.",
    "Dividend Ex-Date": "Jul 29, 2019",
    "EPS": "-0.46",
    "Forward Dividend": "N/A (N/A)",
    "Industry": "Communication Equipment",
    "Last Updated": "2021-08-10 11:07",
    "Market Cap": "34.295B",
    "Next Earnings Date": "N/A",
    "PE Ratio": "N/A",
    "Sector": "Technology",
    "Stock Type": "Company",
    "Symbol": "NOK",
    "Website": "http://www.nokia.com",
    "Yahoo Chart URL": "https://finance.yahoo.com/quote/NOK/chart?p=NOK",
    "Yahoo Options URL": "https://finance.yahoo.com/quote/NOK/options?p=NOK",
    "Yahoo Summary URL": "https://finance.yahoo.com/quote/NOK?p=NOK",
    "Year Range": "3.21 - 9.79"
}