{
    "Average Volume": "5,834,041",
    "Description": "ON Semiconductor Corporation, together with its subsidiaries, manufactures and sells semiconductor components for various electronic devices worldwide. The company operates in three segments: Power Solutions Group (PSG), Advanced Solutions Group (ASG), and Intelligent Sensing Group (ISG). The PSG segment offers analog, discrete, module, and integrated semiconductor products for various applications, such as power switching, power conversion, signal conditioning, circuit protection, signal amplification, and voltage regulation functions. The ASG segment designs and develops analog, mixed-signal, logic, ASSPs and ASICs, Wi-Fi, and power solutions. It also provides trusted foundry and design services for government customers; and manufacturing services. The ISG segment offers complementary metal oxide semiconductors image sensors; proximity sensors; image signal processors; single photon detectors, including SiPM and SPAD arrays; radars; and actuator drivers for autofocus and image stabilization for a range of customers in automotive, industrial, medical, aerospace/defense, communications, networking, wireless, consumer, and computing markets. The company serves original equipment manufacturers, distributors, and electronic manufacturing service providers. ON Semiconductor Corporation was incorporated in 1992 and is headquartered in Phoenix, Arizona.",
    "Dividend Ex-Date": "N/A",
    "EPS": "0.79",
    "Forward Dividend": "N/A (N/A)",
    "Industry": "Semiconductors",
    "Last Updated": "2021-08-10 11:05",
    "Market Cap": "18.959B",
    "Next Earnings Date": "Nov 01, 2021 - Nov 05, 2021",
    "PE Ratio": "56.49",
    "Sector": "Technology",
    "Stock Type": "Company",
    "Symbol": "ON",
    "Website": "http://www.onsemi.com",
    "Yahoo Chart URL": "https://finance.yahoo.com/quote/ON/chart?p=ON",
    "Yahoo Options URL": "https://finance.yahoo.com/quote/ON/options?p=ON",
    "Yahoo Summary URL": "https://finance.yahoo.com/quote/ON?p=ON",
    "Year Range": "19.75 - 46.29"
}