{
    "Average Volume": "7,199,700",
    "Description": "ON Semiconductor Corporation provides intelligent sensing and power solutions in the United States and internationally. The company operates through Power Solutions Group, Advanced Solutions Group, and Intelligent Sensing Group. Its intelligent power technologies enable the electrification of the automotive industry that allows for lighter and longer-range electric vehicles, empowers fast-charging systems, and propels sustainable energy for the solar strings, industrial power, and storage systems. In addition, the company offers analog, discrete, module, and integrated semiconductor products that perform multiple application functions, includes power switching and conversion, signal conditioning, circuit protection, signal amplification, and voltage regulation functions. Further, it designs and develops analog, mixed-signal, power management ICs and sensor interface devices for automotive, industrial, compute and mobile markets. Additionally, the company offers single photon detectors, including silicon photomultipliers and single photon avalanche diode arrays, as well as actuator drivers for autofocus and image stabilization for a broad base of end-users in the different end-markets. ON Semiconductor Corporation was incorporated in 1992 and is headquartered in Scottsdale, Arizona.",
    "Dividend Ex-Date": "N/A",
    "EPS": "4.89",
    "Forward Dividend": "N/A (N/A)",
    "Industry": "Semiconductors",
    "Last Updated": "2024-02-12 09:50",
    "Market Cap": "34.994B",
    "Next Earnings Date": "Apr 29, 2024 - May 03, 2024",
    "PE Ratio": "16.75",
    "Sector": "Technology",
    "Stock Type": "Company",
    "Symbol": "ON",
    "Website": "https://www.onsemi.com",
    "Yahoo Chart URL": "https://finance.yahoo.com/quote/ON/chart?p=ON",
    "Yahoo Options URL": "https://finance.yahoo.com/quote/ON/options?p=ON",
    "Yahoo Summary URL": "https://finance.yahoo.com/quote/ON?p=ON",
    "Year Range": "61.47 - 111.35"
}