{
    "Average Volume": "4,613,601",
    "Description": "Plains All American Pipeline, L.P., through its subsidiaries, engages in the pipeline transportation, terminalling, storage, and gathering of crude oil and natural gas liquids (NGL) in the United States and Canada. The company operates through three segments: Transportation, Facilities, and Supply and Logistics. The Transportation segment transports crude oil and NGL through pipelines, gathering systems, and trucks. As of December 31, 2020, this segment owned and leased 18,370 miles of active crude oil and NGL pipelines and gathering systems; 35 million barrels of active and above-ground tank capacity; and 815 trailers. The Facilities segment provides storage, terminalling, and throughput services for crude oil, NGL, and natural gas; and NGL fractionation and isomerization, and natural gas and condensate processing services. As of December 31, 2020, this segment owned and operated approximately 75 million barrels of crude oil storage capacity; 28 million barrels of NGL storage capacity; 68 billion cubic feet (Bcf) of natural gas storage working capacity; 25 Bcf of base gas; five natural gas processing plants; a condensate processing facility; eight fractionation plants; 22 crude oil and NGL rail terminals; five marine facilities; and approximately 330 miles of active pipelines. The Supply and Logistics segment engages in the purchase, logistics, and resale of crude oil and NGL. As of December 31, 2020, this segment owned 16 million barrels of crude oil and NGL linefill; 4 million barrels of crude oil and NGL linefill; 680 trucks and 840 trailers; and 6,000 crude oil and NGL railcars. The company was incorporated in 1998 and is headquartered in Houston, Texas.",
    "Dividend Ex-Date": "Jul 29, 2021",
    "EPS": "0.16",
    "Forward Dividend": "0.72 (7.61%)",
    "Industry": "Oil & Gas Midstream",
    "Last Updated": "2021-08-10 11:04",
    "Market Cap": "6.865B",
    "Next Earnings Date": "Nov 02, 2021",
    "PE Ratio": "60.96",
    "Sector": "Energy",
    "Stock Type": "Company",
    "Symbol": "PAA",
    "Website": "http://www.plainsallamerican.com",
    "Yahoo Chart URL": "https://finance.yahoo.com/quote/PAA/chart?p=PAA",
    "Yahoo Options URL": "https://finance.yahoo.com/quote/PAA/options?p=PAA",
    "Yahoo Summary URL": "https://finance.yahoo.com/quote/PAA?p=PAA",
    "Year Range": "5.26 - 12.38"
}