{
    "Average Volume": "3,017,310",
    "Description": "Rocket Companies, Inc., a fintech holding company, provides mortgage lending, title and settlement services, and other financial technology services in the United States and Canada. It operates through two segments, Direct to Consumer and Partner Network. The company's solutions include Rocket Mortgage, a mortgage lender; Amrock that provides title insurance, property valuation, and settlement services; Rocket Homes, a home search platform and real estate agent referral network, which offers technology-enabled services to support the home buying and selling experience; and Rocket Loans, an online-based personal loans business. It also offers Core Digital Media, a online marketing platform in the mortgage and personal financial product sectors; Rocket Money, a personal finance app that helps clients manage every aspect of their financial lives; Lendesk, a software services company that provides a point of sale system for mortgage professionals and a loan origination system for private lenders; Rock Connections, a sales and support platform specializing in contact center services; and Rocket Innovation Studio that recruits and mentors top technology talent. In addition, the company originates, closes, sells, and services agency-conforming loans. Rocket Companies, Inc. was founded in 1985 and is headquartered in Detroit, Michigan. The company operates as a subsidiary of Rock Holdings Inc.",
    "Dividend Ex-Date": "Mar 07, 2022",
    "EPS": "1.80",
    "Forward Dividend": "N/A (N/A)",
    "Industry": "Mortgage Finance",
    "Last Updated": "2024-03-01 08:06",
    "Market Cap": "24.96B",
    "Next Earnings Date": "May 02, 2024 - May 06, 2024",
    "PE Ratio": "6.97",
    "Sector": "Financial Services",
    "Stock Type": "Company",
    "Symbol": "RKT",
    "Website": "https://www.rocketcompanies.com",
    "Yahoo Chart URL": "https://finance.yahoo.com/quote/RKT/chart?p=RKT",
    "Yahoo Options URL": "https://finance.yahoo.com/quote/RKT/options?p=RKT",
    "Yahoo Summary URL": "https://finance.yahoo.com/quote/RKT?p=RKT",
    "Year Range": "7.17 - 15.19"
}