{
    "Average Volume": "1,368,768",
    "Description": "RingCentral, Inc., together with its subsidiaries, provides cloud communications, video meetings, collaboration, and contact center software-as-a-service solutions worldwide. The company's products include RingCentral Message Video Phone that provides a unified experience for communication and collaboration across multiple modes, including HD voice, video, SMS, messaging and collaboration, conferencing, online meetings, and fax; RingCentral Contact Center, a collaborative contact center solution that delivers AI-powered omnichannel and workforce engagement solutions with integrated RingCentral MVP; and RingCX, an AI-powered contact center that a native delivers omnichannel experience. It provides RingCentral Video, a video meeting service that includes the company's RCV video and team messaging capabilities; offers video and audio conferencing, team messaging, file sharing, contact, task, and calendar management, as well as pre-meeting, in-meeting, and post-meeting capabilities. In addition, the company offers RingCentral Professional Services, which include consultation, UCaaS and CCaaS implementation, VoIP phone system adoption, configuring custom workflows, customer and user onboarding, ongoing support, advanced support, managed services, and more. It serves a range of industries, including financial services, education, healthcare, legal services, real estate, retail, technology, insurance, construction, hospitality, state and local government, and others. It sells its products to enterprise customers, as well as small and medium-sized businesses through resellers and distributors, partners, and global service providers. RingCentral, Inc. was incorporated in 1999 and is headquartered in Belmont, California.",
    "Dividend Ex-Date": "N/A",
    "EPS": "-1.74",
    "Forward Dividend": "N/A (N/A)",
    "Industry": "Software - Application",
    "Last Updated": "2024-03-04 08:38",
    "Market Cap": "3.127B",
    "Next Earnings Date": "May 07, 2024 - May 13, 2024",
    "PE Ratio": "N/A",
    "Sector": "Technology",
    "Stock Type": "Company",
    "Symbol": "RNG",
    "Website": "https://www.ringcentral.com",
    "Yahoo Chart URL": "https://finance.yahoo.com/quote/RNG/chart?p=RNG",
    "Yahoo Options URL": "https://finance.yahoo.com/quote/RNG/options?p=RNG",
    "Yahoo Summary URL": "https://finance.yahoo.com/quote/RNG?p=RNG",
    "Year Range": "25.08 - 43.28"
}