{
    "Average Volume": "347,204",
    "Description": "Stamps.com Inc. provides Internet-based mailing and shipping solutions in the United States and Europe. It operates in two segments, Stamps.com and Metapack. The company offers mailing and shipping solutions to mail and ship various mail pieces and packages through the United States Postal Service (USPS) under the Stamps.com, Endicia, Metapack, ShippingEasy, ShipEngine, ShipStation, and ShipWorks brands. Its solutions support various USPS mail classes, including First Class Mail, Media Mail, Parcel Select, Priority Mail, Priority Mail Express, and others. The company's USPS mailing solutions enable customers to print electronic postage on labels, envelopes, postcards, paper, and customs forms using personal computing device, printer, and Internet connection. It also provides multi carrier shipping solutions; consolidation services; back-end integration solutions comprising electronic postage for transactions to partners who manage the front-end users; and branded insurance for packages. In addition, the company offers customized postage solutions under the PhotoStamps brand, which allow consumers to turn digital photos, designs, or images into USPS-approved postage; and sells NetStamps labels, shipping labels, mailing labels, postage printers, scales, and other mailing and shipping-focused office supplies through its mailing and shipping supplies stores. It serves small businesses, home offices, medium-size businesses, large enterprises, e-commerce merchants, large retailers, and shippers. The company was formerly known as StampMaster, Inc. and changed its name to Stamps.com Inc. in December 1998. Stamps.com Inc. was founded in 1996 and is headquartered in El Segundo, California.",
    "Dividend Ex-Date": "Nov 08, 2010",
    "EPS": "10.10",
    "Forward Dividend": "N/A (N/A)",
    "Industry": "Software—Application",
    "Last Updated": "2021-05-12 13:28",
    "Market Cap": "3.086B",
    "Next Earnings Date": "Aug 04, 2021 - Aug 09, 2021",
    "PE Ratio": "16.68",
    "Sector": "Technology",
    "Stock Type": "Company",
    "Symbol": "STMP",
    "Website": "http://www.stamps.com",
    "Year Range": "166.19 - 325.13"
}