{
    "Average Volume": "1,930,331",
    "Description": "Skyworks Solutions, Inc., together with its subsidiaries, designs, develops, manufactures, and markets proprietary semiconductor products in the United States, China, South Korea, Taiwan, Europe, the Middle East, Africa, and the rest of Asia-Pacific. Its product portfolio includes amplifiers, antenna tuners, attenuators, automotive tuners and digital radios, DC/DC converters, demodulators, detectors, diodes, wireless analog system on chip products, directional couplers, diversity receive modules, filters, front-end modules, hybrids, light emitting diode drivers, low noise amplifiers, mixers, modulators, optocouplers/optoisolators, phase locked loops, phase shifters, power dividers/combiners, power over ethernet, power isolators, receivers, switches, synthesizers, timing devices, voltage controlled oscillators/synthesizers, and voltage regulators. The company products are the used in aerospace, automotive, broadband, cellular infrastructure, connected home, defense, entertainment and gaming, industrial, medical, military, smartphone, tablet, and wearable markets. It sells its products through direct sales force, electronic component distributors, and independent sales representatives. Skyworks Solutions, Inc. was founded in 1962 and is based in Irvine, California.",
    "Dividend Ex-Date": "Feb 16, 2024",
    "EPS": "5.64",
    "Forward Dividend": "2.72 (2.59%)",
    "Industry": "Semiconductors",
    "Last Updated": "2024-02-12 09:50",
    "Market Cap": "16.929B",
    "Next Earnings Date": "May 06, 2024 - May 10, 2024",
    "PE Ratio": "18.73",
    "Sector": "Technology",
    "Stock Type": "Company",
    "Symbol": "SWKS",
    "Website": "https://www.skyworksinc.com",
    "Yahoo Chart URL": "https://finance.yahoo.com/quote/SWKS/chart?p=SWKS",
    "Yahoo Options URL": "https://finance.yahoo.com/quote/SWKS/options?p=SWKS",
    "Yahoo Summary URL": "https://finance.yahoo.com/quote/SWKS?p=SWKS",
    "Year Range": "85.06 - 122.45"
}