{
    "Average Volume": "3,225,044",
    "Description": "Tapestry, Inc. provides luxury accessories and branded lifestyle products in the United States, Japan, Greater China, and internationally. The company operates through three segments: Coach, Kate Spade, and Stuart Weitzman. The company offers women's accessories, including handbags, such as wallets, money pieces, wristlets, and cosmetic cases; novelty accessories comprising address books, time management and travel accessories, sketchbooks, and portfolios; and key rings and charms. It also provides bag collections, including business cases, computer bags, messenger-style bags, backpacks, and totes; small leather goods, such as wallets, card cases, travel organizers, and belts; and footwear, watches, sunglasses, novelty accessories, and ready-to-wear for men. In addition, the company offers women's footwear; sunglasses; bracelets, necklaces, rings, and earrings; fragrances and watches; women's seasonal lifestyle apparel collections that include outerwear and ready-to-wear, and cold weather accessories, which comprise gloves, scarves, and hats. Further, it provides footwear items; and housewares and home accessories for kids, such as fashion bedding and tableware; and stationery and gifts. Additionally, the company licenses rights to market and distribute its jewelry, eyewear, watches, fragrances, and tech accessories under the Coach brand; and fashion beddings, tableware and housewares, eyewear, watches, stationery and gifts, and tech accessories under the Kate Spade brand. As of July 3, 2021, it operated through a network of 939 Coach stores, 407 Kate Spade stores, and 104 Stuart Weitzman stores. The company sells its products through e-commerce sites and concession shop-in-shops, and wholesale customers, as well as through independent third-party distributors. The company was formerly known as Coach, Inc. and changed its name to Tapestry, Inc. in October 2017. Tapestry, Inc. was founded in 1941 and is based in New York, New York.",
    "Dividend Ex-Date": "Sep 03, 2021",
    "EPS": "2.95",
    "Forward Dividend": "1.00 (2.46%)",
    "Industry": "Luxury Goods",
    "Last Updated": "2021-08-23 09:01",
    "Market Cap": "11.345B",
    "Next Earnings Date": "Nov 11, 2021",
    "PE Ratio": "13.76",
    "Sector": "Consumer Cyclical",
    "Stock Type": "Company",
    "Symbol": "TPR",
    "Website": "http://www.tapestry.com",
    "Yahoo Chart URL": "https://finance.yahoo.com/quote/TPR/chart?p=TPR",
    "Yahoo Options URL": "https://finance.yahoo.com/quote/TPR/options?p=TPR",
    "Yahoo Summary URL": "https://finance.yahoo.com/quote/TPR?p=TPR",
    "Year Range": "14.14 - 49.67"
}