{
    "Average Volume": "5,400,133",
    "Description": "Under Armour, Inc., together with its subsidiaries, develops, markets, and distributes branded performance apparel, footwear, and accessories for men, women, and youth primarily in North America, Europe, the Middle East, Africa, the Asia-Pacific, and Latin America. The company offers its apparel in compression, fitted, and loose types to be worn in hot and cold. It also provides various footwear products for running, basketball, cleated sports, slides, training, and outdoor. In addition, the company offers accessories, which include gloves, bags, headwear, and sports masks; and digital fitness subscriptions, as well as digital advertising through MapMyFitness platform. It primarily offers its products under the HEATGEAR, COLDGEAR, RUSH or RECOVER, UA HOVR, UA Logo, UNDER ARMOUR, UA, ARMOUR, PROTECT THIS HOUSE, I WILL, ARMOUR BRA, and ARMOUR FLEECE brands. The company sells its products through wholesale channels, including national and regional sporting goods chains, independent and specialty retailers, department store chains, mono-branded Under Armour retail stores, institutional athletic departments, and leagues and teams, as well as independent distributors; and directly to consumers through a network of 439 brand and factory house stores, as well as through e-commerce websites. Under Armour, Inc. was founded in 1996 and is headquartered in Baltimore, Maryland.",
    "Dividend Ex-Date": "N/A",
    "EPS": "0.79",
    "Forward Dividend": "N/A (N/A)",
    "Industry": "Apparel Manufacturing",
    "Last Updated": "2021-08-10 11:04",
    "Market Cap": "11.1B",
    "Next Earnings Date": "Oct 28, 2021 - Nov 01, 2021",
    "PE Ratio": "32.70",
    "Sector": "Consumer Cyclical",
    "Stock Type": "Company",
    "Symbol": "UAA",
    "Website": "http://www.underarmour.com",
    "Yahoo Chart URL": "https://finance.yahoo.com/quote/UAA/chart?p=UAA",
    "Yahoo Options URL": "https://finance.yahoo.com/quote/UAA/options?p=UAA",
    "Yahoo Summary URL": "https://finance.yahoo.com/quote/UAA?p=UAA",
    "Year Range": "9.66 - 26.45"
}