{
    "Average Volume": "30,897,488",
    "Description": "Uber Technologies, Inc. develops and operates proprietary technology applications in the United States, Canada, Latin America, Europe, the Middle East, Africa, and Asia excluding China and Southeast Asia. It operates through three segments: Mobility, Delivery, and Freight. The Mobility segment connects consumers with a range of transportation modalities, such as ridesharing, carsharing, micromobility, rentals, public transit, taxis, and other modalities; and offers riders in a variety of vehicle types, as well as financial partnerships products and advertising services. The Delivery segment allows to search for and discover restaurants to grocery, alcohol, convenience, and other retails; order a meal or other items; and Uber direct, a white-label Delivery-as-a-Service for retailers and restaurants, as well as advertising. The Freight segment manages transportation and logistics network, which connects shippers and carriers in digital marketplace including carriers upfronts, pricing, and shipment booking; and provides on-demand platform to automate logistics end-to-end transactions for small-and medium-sized business to global enterprises. Uber Technologies, Inc. was formerly known as Ubercab, Inc. and changed its name to Uber Technologies, Inc. in February 2011. The company was founded in 2009 and is headquartered in San Francisco, California.",
    "Dividend Ex-Date": "N/A",
    "EPS": "0.87",
    "Forward Dividend": "N/A (N/A)",
    "Industry": "Software - Application",
    "Last Updated": "2024-02-12 09:48",
    "Market Cap": "146.459B",
    "Next Earnings Date": "Apr 30, 2024 - May 06, 2024",
    "PE Ratio": "81.01",
    "Sector": "Technology",
    "Stock Type": "Company",
    "Symbol": "UBER",
    "Website": "https://www.uber.com",
    "Yahoo Chart URL": "https://finance.yahoo.com/quote/UBER/chart?p=UBER",
    "Yahoo Options URL": "https://finance.yahoo.com/quote/UBER/options?p=UBER",
    "Yahoo Summary URL": "https://finance.yahoo.com/quote/UBER?p=UBER",
    "Year Range": "29.22 - 73.05"
}