{
    "Average Volume": "15,011,554",
    "Description": "ViacomCBS Inc. operates as a media and entertainment company worldwide. The company operates through TV Entertainment, Cable Networks, and Filmed Entertainment segments. The TV Entertainment segment distributes a schedule of news and public affairs broadcasts, and sports and entertainment programming; acquires or develops, and schedules programming on the CBS Television Network that includes primetime comedies and dramas, reality, specials, kids' programs, daytime dramas, game shows, and late night programs; produces or distributes talk shows, court shows, game shows, and newsmagazines; owns and operates 29 broadcast television stations; and operates CBS Sports Network, a 24/7 cable program service that provides college sports and related content, as well as streaming and cable subscription services. The Cable Networks segment creates and acquires programming for distribution and viewing on various media platforms, including subscription cable networks, subscription streaming, and basic cable networks. The Filmed Entertainment segment develops, produces, finances, acquires, and distributes films. The company was formerly known as CBS Corporation and changed its name to ViacomCBS Inc. in December 2019. ViacomCBS Inc. was incorporated in 1986 and is headquartered in New York, New York.",
    "Dividend Ex-Date": "Sep 14, 2021",
    "EPS": "5.33",
    "Forward Dividend": "0.96 (2.46%)",
    "Industry": "Entertainment",
    "Last Updated": "2021-08-18 13:00",
    "Market Cap": "26.853B",
    "Next Earnings Date": "Nov 04, 2021 - Nov 08, 2021",
    "PE Ratio": "7.75",
    "Sector": "Communication Services",
    "Stock Type": "Company",
    "Symbol": "VIAC",
    "Website": "http://www.viacomcbs.com",
    "Yahoo Chart URL": "https://finance.yahoo.com/quote/VIAC/chart?p=VIAC",
    "Yahoo Options URL": "https://finance.yahoo.com/quote/VIAC/options?p=VIAC",
    "Yahoo Summary URL": "https://finance.yahoo.com/quote/VIAC?p=VIAC",
    "Year Range": "26.29 - 101.97"
}