{
    "Average Volume": "11,087,740",
    "Description": "Viatris Inc., a healthcare company, develops, licenses, manufactures, markets, and distributes brand and generic drugs, complex generics, biosimilars, and active pharmaceutical ingredients (APIs) worldwide. The company operates through Developed Markets, Greater China, JANZ, and Emerging Markets segments. It offers drugs in various therapeutic areas, including infectious diseases and non-communicable diseases; HIV/AIDS; and oncology, immunology, endocrinology, ophthalmology, and dermatology, as well as antibacterial, central nervous system agents, antihistamines/antiasthmatics, cardiovascular, antivirals, antidiabetics, antifungals, and proton pump inhibitor areas. The company provides medicines, such as Wixela, Inhub, ADVAIR DISKUS, glatiramer acetate injection, Copaxone, and over the counter products in the form of oral solid doses, injectables, complex dosage forms, and APIs to retail and pharmacy establishments, wholesalers and distributors, payers, insurers and governments, and institutions; and support services, such as diagnostic clinics, educational seminars, and digital tools to help patients better manage their health. It distributes its products through pharmaceutical wholesalers/distributors, pharmaceutical retailers, institutional pharmacies, mail-order and e-commerce pharmacies, and specialty pharmacies. The company sells its products under the Lyrica, Lipitor, Creon, Influvac, Wixela Inhub, and EpiPen auto-injector; Norvasc and Viagra; AMITIZA, Lipacreon, and Effexor; Trastuzumab injection; and Celebrex and anti-retrovirals names, as well as offers biosimilars franchises, including Fulphila, Ogivri, and Hulio. Viatris Inc. has collaboration and licensing agreements with Revance Therapeutics, Inc.; Momenta Pharmaceuticals, Inc.; Theravance Biopharma, Inc.; Biocon Ltd.; and Fujifilm Kyowa Kirin Biologics Co. Ltd. The company was founded in 1961 and is based in Canonsburg, Pennsylvania.",
    "Dividend Ex-Date": "May 21, 2021",
    "EPS": "N/A",
    "Forward Dividend": "0.44 (2.93%)",
    "Industry": "Drug Manufacturers—Specialty & Generic",
    "Last Updated": "2021-05-11 21:15",
    "Market Cap": "18.299B",
    "Next Earnings Date": "May 10, 2021",
    "PE Ratio": "N/A",
    "Sector": "Healthcare",
    "Stock Type": "Company",
    "Symbol": "VTRS",
    "Website": "http://www.viatris.com",
    "Year Range": "12.94 - 19.24"
}