{
    "Average Volume": "6,951,242",
    "Description": "The Williams Companies, Inc., together with its subsidiaries, operates as an energy infrastructure company primarily in the United States. It operates through Transmission & Gulf of Mexico, Northeast G&P, West, and Gas & NGL Marketing Services segments. The Transmission & Gulf of Mexico segment comprises natural gas pipelines; Transco, Northwest pipeline, MountainWest, and related natural gas storage facilities; and natural gas gathering and processing, and crude oil production handling and transportation assets in the Gulf Coast region. The Northeast G&P segment engages in the midstream gathering, processing, and fractionation activities in the Marcellus Shale region primarily in Pennsylvania and New York, and the Utica Shale region of eastern Ohio. The West segment consists of gas gathering, processing, and treating operations in the Rocky Mountain region of Colorado and Wyoming, the Barnett Shale region of north-central Texas, the Eagle Ford Shale region of South Texas, the Haynesville Shale region of northwest Louisiana, the Mid-Continent region that includes the Anadarko and Permian basins, and the DJ Basin of Colorado; and operates natural gas liquid (NGL) fractionation and storage facilities in central Kansas near Conway. The Gas & NGL Marketing Services segment provides wholesale marketing, trading, storage, and transportation of natural gas for natural gas utilities, municipalities, power generators, and producers; asset management services; and transports and markets NGLs. The company owns and operates 33,000 miles of pipelines. The Williams Companies, Inc. was founded in 1908 and is headquartered in Tulsa, Oklahoma.",
    "Dividend Ex-Date": "Mar 07, 2024",
    "EPS": "2.68",
    "Forward Dividend": "1.90 (5.44%)",
    "Industry": "Oil & Gas Midstream",
    "Last Updated": "2024-02-23 08:41",
    "Market Cap": "42.465B",
    "Next Earnings Date": "May 01, 2024 - May 06, 2024",
    "PE Ratio": "13.02",
    "Sector": "Energy",
    "Stock Type": "Company",
    "Symbol": "WMB",
    "Website": "https://www.williams.com",
    "Yahoo Chart URL": "https://finance.yahoo.com/quote/WMB/chart?p=WMB",
    "Yahoo Options URL": "https://finance.yahoo.com/quote/WMB/options?p=WMB",
    "Yahoo Summary URL": "https://finance.yahoo.com/quote/WMB?p=WMB",
    "Year Range": "27.80 - 37.45"
}