{
    "CAG": {
        "Company": "Conagra Brands, Inc.",
        "EPS Estimate": 0.68,
        "Earnings Call Time": "TAS",
        "Earnings Date": "2024-01-04",
        "Event Name": "-",
        "Reported EPS": 0.71,
        "Surprise(%)": 4.57,
        "days_since_earnings": 2,
        "earnings_score": 50.0,
        "is_close_greater_than_sma": false,
        "is_close_nearer_2_stdev": false,
        "is_trend_positive": false,
        "price_history_score": 0.0,
        "profile_data": {
            "Average Volume": "4,488,367",
            "Description": "Conagra Brands, Inc., together with its subsidiaries, operates as a consumer packaged goods food company primarily in the United States. The company operates through Grocery & Snacks, Refrigerated & Frozen, International, and Foodservice segments. The Grocery & Snacks segment primarily offers shelf stable food products through various retail channels. The Refrigerated & Frozen segment provides temperature-controlled food products through various retail channels. The International segment offers food products in various temperature states through retail and foodservice channels outside of the United States. The Foodservice segment offers branded and customized food products, including meals, entrees, sauces, and various custom-manufactured culinary products packaged for restaurants and other foodservice establishments. The company sells its products under the Birds Eye, Marie Callender's, Duncan Hines, Healthy Choice, Slim Jim, Reddi-wip, Angie's, BOOMCHICKAPOP, Duke's, Earth Balance, Gardein, and Frontera brands. The company was incorporated in 1919 and is headquartered in Chicago, Illinois.",
            "Dividend Ex-Date": "Jan 29, 2024",
            "EPS": "2.05",
            "Forward Dividend": "1.40 (4.96%)",
            "Industry": "Packaged Foods",
            "Last Updated": "2024-01-06 19:10",
            "Market Cap": "13.485B",
            "Next Earnings Date": "Apr 03, 2024 - Apr 08, 2024",
            "PE Ratio": "13.76",
            "Sector": "Consumer Defensive",
            "Stock Type": "Company",
            "Symbol": "CAG",
            "Website": "https://www.conagrabrands.com",
            "Yahoo Chart URL": "https://finance.yahoo.com/quote/CAG/chart?p=CAG",
            "Yahoo Options URL": "https://finance.yahoo.com/quote/CAG/options?p=CAG",
            "Yahoo Summary URL": "https://finance.yahoo.com/quote/CAG?p=CAG",
            "Year Range": "25.16 - 41.30"
        }
    },
    "WBA": {
        "Company": "Walgreens Boots Alliance, Inc.",
        "EPS Estimate": 0.61,
        "Earnings Call Time": "TAS",
        "Earnings Date": "2024-01-04",
        "Event Name": "-",
        "Reported EPS": 0.66,
        "Surprise(%)": 7.67,
        "days_since_earnings": 2,
        "earnings_score": 50.0,
        "is_close_greater_than_sma": true,
        "is_close_nearer_2_stdev": false,
        "is_trend_positive": false,
        "price_history_score": 0.4,
        "profile_data": {
            "Average Volume": "13,713,650",
            "Description": "Walgreens Boots Alliance, Inc. operates as a healthcare, pharmacy, and retail company in the United States, the United Kingdom, Germany, and internationally. It operates through three segments: U.S. Retail Pharmacy, International, and U.S. Healthcare. The U.S. Retail Pharmacy segment engages in operation of the retail drugstores, health and wellness services, specialty, and home delivery pharmacy services, which offers health and wellness, beauty, personal care and consumables, and general merchandise. The International segment offers sale of prescription drugs and health and wellness, beauty, personal care, and other consumer products outside the United States; and operates pharmacy-led health and beauty retail businesses under the Boots brand stores in the United Kingdom, the Republic of Ireland, and Thailand, as well as the Benavides brand in Mexico and the Ahumada brand in Chile. The U.S. Healthcare segment provides VillageMD, a national provider of value-based care with primary, multi-specialty, and urgent care providers serving patients in traditional clinic settings, in patients' homes and online appointments; Shields, a specialty pharmacy integrator and accelerator for hospitals; and CareCentrix, a participant in the post-acute and home care management sectors. Walgreens Boots Alliance, Inc. was founded in 1909 and is headquartered in Deerfield, Illinois.",
            "Dividend Ex-Date": "Feb 16, 2024",
            "EPS": "0.66",
            "Forward Dividend": "1.00 (4.00%)",
            "Industry": "Pharmaceutical Retailers",
            "Last Updated": "2024-01-06 19:10",
            "Market Cap": "21.568B",
            "Next Earnings Date": "Mar 26, 2024 - Apr 01, 2024",
            "PE Ratio": "37.89",
            "Sector": "Healthcare",
            "Stock Type": "Company",
            "Symbol": "WBA",
            "Website": "https://www.walgreensbootsalliance.com",
            "Yahoo Chart URL": "https://finance.yahoo.com/quote/WBA/chart?p=WBA",
            "Yahoo Options URL": "https://finance.yahoo.com/quote/WBA/options?p=WBA",
            "Yahoo Summary URL": "https://finance.yahoo.com/quote/WBA?p=WBA",
            "Year Range": "19.68 - 37.96"
        }
    }
}